In [ ]:
%pip install pandas

Collecting pandas
  Using cached pandas-2.2.3-cp312-cp312-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in d:\codespace\git publish\python for data science, ai & development\.venv\lib\site-packages (from pandas) (2.2.6)
Requirement already satisfied: python-dateutil>=2.8.2 in d:\codespace\git publish\python for data science, ai & development\.venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in d:\codespace\git publish\python for data science, ai & development\.venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in d:\codespace\git publish\python for data science, ai & development\.venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in d:\codespace\git publish\python for data science, ai & development\.venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Using cached pandas-2.2.3-cp312-cp312-win_amd64.whl (11.5 MB)
Installing collected packages: pandas
Successfully installed pandas-2.2.3
Note: you may need to restart the kernel to use updated packages.

In [1]:
import pandas as pd

In [ ]:
#Dataframe from Dictionary:

#dictionary 'x'
x = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
      'Salary':[100000, 80000, 50000, 60000]}

#casting the dictionary to a DataFrame
df = pd.DataFrame(x)
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [ ]:
#Retrieve "ID" column:
x = df[['ID']]
x

   ID
0   1
1   2
2   3
3   4

In [4]:
#check the type of x
type(x)

pandas.core.frame.DataFrame

##### Accessing Multiple columns

In [ ]:
#Retrieving 3 cols: Department, Salary and ID
z = df[['Department','Salary','ID']]
z

        Department  Salary  ID
0  Architect Group  100000   1
1   Software Group   80000   2
2      Design Team   50000   3
3   Infrastructure   60000   4

#### Lab exercise:

In [8]:
#Creating DF for given table:
import pandas as pd

x={
    'Student': ['David','Samuel','Terry','Evan'],
    'Age': [27,24,22,32],
    'Country': ['UK','Canada','China','USA'],
    'Course': ['Python','Data Structures','Machine Learning','Web Development'],
    'Marks': [85,72,89,76]
}

df = pd.DataFrame(x)  #typecasting
df

  Student  Age Country            Course  Marks
0   David   27      UK            Python     85
1  Samuel   24  Canada   Data Structures     72
2   Terry   22   China  Machine Learning     89
3    Evan   32     USA   Web Development     76

In [11]:
#Column retrieval:
b = df[['Marks']]    #remember: Python is case sensitive
b

   Marks
0     85
1     72
2     89
3     76

In [13]:
#Retrieving 2 columns:
b = df[['Country','Course']]
b

  Country            Course
0      UK            Python
1  Canada   Data Structures
2   China  Machine Learning
3     USA   Web Development

Use 1 bracket >> Get column as Series:

In [ ]:
b = df['Country']   #return *Series*= 1-D Dataframe> 2 cols won't work
b

0        UK
1    Canada
2     China
3       USA
Name: Country, dtype: object

In [16]:
type(b)

pandas.core.series.Series

#### Lab 2: loc() and iloc() functions<br>
`loc()` - uses Labels as args<br>
`iloc()` - uses Index as args

In [17]:
# Create a df for exercise:
y = {
    'Name': ['Rose','John', 'Jane', 'Mary'],
    'ID': [1, 2, 3, 4],
    'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'],
    'Salary': [100000, 80000, 50000, 60000]
}

df2 = pd.DataFrame(y)
df2

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [22]:
#first row and the third column
df2.iloc[0,2]

'Architect Group'

In [23]:
#first row and the third column -Using Name:
df2.loc[0,'Department']

'Architect Group'

#### `head()` Function:<br>
`dataframe.head()` -used to display the _first n rows_ of a DataFrame. <u>Useful for quickly inspecting the Data</u> and verifying if it has been loaded correctly. <br>
- By default, it shows the first 5 rows, but you can specify a different number of rows as an argument. 
- If n > number of rows in the DataFrame, it will return all rows. 
- For -ve n, it returns all rows except the last abs(n) rows (truncates below rows too)

In [24]:
df2.head()

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [25]:
df2.head(3)

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000

In [27]:
df2.head()

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [28]:
df2.head(-2)

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000

Setting an Index column:

In [31]:
#set Name as index col:
df2 = df2.set_index("Name")   #returns a DataFrame!
df2

      ID       Department  Salary
Name
Rose   1  Architect Group  100000
John   2   Software Group   80000
Jane   3      Design Team   50000
Mary   4   Infrastructure   60000

In [32]:
#get John's Dept:
df2.loc['John','Department']

'Software Group'

In [ ]:
#get salary of Mary:
df2.iloc[2,2]   #IMP:both indices(row & col) start from '0'

np.int64(50000)

#### Slicing:<br>
_Syntax:_  `data[start:stop]`
-> start stop can be represented using:
- range of Indexes (Basic slicing)
- specific rows&cols (Label-based slicing), or..
- specifying range of rows, & range of cols using indexes (Index-based slicing).

In [35]:
#import pandas as pd
# Create a sample DataFrame
data = {'col1': [1, 2, 3, 4, 5],
        'col2': ['A', 'B', 'C', 'D', 'E'],
        'col3': [True, False, True, False, True]}
df = pd.DataFrame(data)
df

   col1 col2   col3
0     1    A   True
1     2    B  False
2     3    C   True
3     4    D  False
4     5    E   True

In [ ]:
#1. Basic slicing: select rows from index 1 to 3 (exclusive)
df[1:3]    #<<note that 2nd index is not-included in the map.

   col1 col2   col3
1     2    B  False
2     3    C   True

In [ ]:
#2. Label-based slicing: here we are *selecting* rows&cols: Rows with index 1 and 3, and columns 'col1' and 'col3'
df.loc[[1, 3], ['col1', 'col3']]    #<<specific rows&cols named (eg. r3 is not included)

   col1   col3
1     2  False
3     4  False

In [ ]:
#3. Integer-based slicing: select rows from index 0 to 2(exclusive) and columns from index 0 to 2(exclusive)
print(df, "\n")
df.iloc[0:2, 0:2]

   col1 col2   col3
0     1    A   True
1     2    B  False
2     3    C   True
3     4    D  False
4     5    E   True

   col1 col2
0     1    A
1     2    B

In [ ]:
print(df, "\n")
print(df[1:3])  #<Index-based slicing
#Doing the same using <Integer-based slicing>
df.iloc[1:3, 0:3]   #Select: Rows r1-3exclusive, Cols c0:3exclusive

   col1 col2   col3
0     1    A   True
1     2    B  False
2     3    C   True
3     4    D  False
4     5    E   True

   col1 col2   col3
1     2    B  False
2     3    C   True

   col1 col2   col3
1     2    B  False
2     3    C   True


Slicing can also be combined with boolean indexing to filter data based on conditions.

In [53]:
# Select rows where 'col1' is greater than 2 and 'col2' is 'C'
df[(df['col1'] > 2) & (df['col3'] == True)]

   col1 col2  col3
2     3    C  True
4     5    E  True